# 1407
# 2247

# 20! = 20 * 19 * 18 * ... 1
# 20 팩토리얼에는 2가 몇 번 곱해져 있을까?

# 완전탐색

#  1   2   3   4   5   6   7   8   9   10
#      1       2       1       3        1   
#  11  12  13  14  15  16  17  18  19  20
#      2       1       4       1        2

# 총 18번 곱해져있다.

# 정수론, 쉽게 구하는 법

#  1   2   3   4   5   6   7   8   9   10
#      o       o       o       o        o
#              o               o
#                              o
#  11  12  13  14  15  16  17  18  19  20
#      o       o       o       o        o
#      o               o                o
#                      o
#                      o

# 1부터 20까지 2의 제곱수로 나누어 지는 숫자들의 총 합을 구하면 된다.
 